app/views/users/show.html.erb

SELECT `debates`.* FROM `debates` WHERE `debates`.`created_user_id` = 3
---
      <div class="" id="created-debates" role="tabpanel" aria-labelledby="created-debates-tab">
        <% Debate.where(created_user_id: @user.id).each do |debate| %>

SELECT `debates`.* FROM `debates` WHERE `debates`.`joined_user_id` = 3
---
      <div class="tab-pane fade" id="joinned-debates" role="tabpanel" aria-labelledby="joinned-debates-tab">
        <% Debate.where(joined_user_id: @user.id).each do |debate| %>