app/views/shared/_winorlose_stats.html.erb

SELECT COUNT(*) FROM `win_or_loses` WHERE `win_or_loses`.`winner_id` = 3
---
    <strong id="winner" class="stat">
      <%= WinOrLose.where(winner_id: @user.id).count %>

SELECT COUNT(*) FROM `win_or_loses` WHERE `win_or_loses`.`loser_id` = 3
---
    <strong id="loser" class="stat">
      <%= WinOrLose.where(loser_id: @user.id).count %>