app/views/debates/_conversation.html.erb

      <div class="text-sm">
        <p class="text-gray-900 leading-none"><%= User.find(conversation.user_id).name%></p>
        <p class="text-gray-600"><%= time_ago_in_words(conversation.created_at) %></p>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `conversations` (`user_id`, `debate_id`, `content`, `created_at`, `updated_at`) VALUES (3, 18, 'test4', '2022-04-06 11:03:00.102009', '2022-04-06 11:03:00.102009')