app/views/debates/_debate.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
        <div class="text-sm flex gap-x-3">
          <p class="text-gray-900 leading-none hover:underline mt-4"><%= link_to User.find(debate.created_user_id).name, User.find(debate.  created_user_id) %></p>

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
        <div class="text-sm  flex gap-x-3">
          <p class="text-gray-900 leading-none hover:underline mt-4"><%= link_to User.find(debate.joined_user_id).name, User.find(debate. joined_user_id) %></p>