app/views/debates/_debate.html.erb

      <td>
        <%= debate.liked_users.count %>
---
SELECT `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`debate_id` = 18 LIMIT 1