app/views/debates/show.html.erb

        <h2>議論作成者</h2>
        <%= link_to User.find(@debate.created_user_id).name, User.find(@debate.created_user_id) %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

        <% if @debate.joined_user_id != nil %>
          <%= link_to User.find(@debate.joined_user_id).name, User.find(@debate.joined_user_id) %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

        <% else %>
          <% if !(Vote.where(debate_id: @debate.id, voted_user_id: current_user.id).nil?) %>
---
SELECT `votes`.* FROM `votes` WHERE `votes`.`debate_id` = 18 AND `votes`.`voted_user_id` = 3 LIMIT 1