app/views/debates/show.html.erb

  <p>議論作成者</p>
  <%= link_to User.find(@debate.created_user_id).name, User.find(@debate.created_user_id) %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1

  <% if @debate.joined_user_id != nil %>
    <%= link_to User.find(@debate.joined_user_id).name, User.find(@debate.joined_user_id) %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    <h2>Winner</h2>
    <%= User.find(@debate.WinOrLose.winner_id).name %>
    <h2>Loser</h2>
    <%= User.find(@debate.WinOrLose.loser_id).name %>
---
SELECT `win_or_loses`.* FROM `win_or_loses` WHERE `win_or_loses`.`debate_id` = 19 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

    <%# 参加者のどちらかへの投票ボタン %>
    <%= button_to User.find(@debate.created_user_id).name , debates_vote_created_path(@debate), method: :get %>
    <%= button_to User.find(@debate.joined_user_id).name , debates_vote_joined_path(@debate), method: :get %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1