app/channels/debate_channel.rb

INSERT INTO `conversations` (`user_id`, `debate_id`, `content`, `created_at`, `updated_at`) VALUES (3, 18, 'test', '2022-04-06 07:41:47.943035', '2022-04-06 07:41:47.943035')
---
  def speak(data)
    current_user.Conversations.create!(content: data['conversation'], debate_id: params['debate_id'])