app/controllers/comments_controller.rb

INSERT INTO `comments` (`user_id`, `debate_id`, `content`, `created_at`, `updated_at`) VALUES (1, 18, 'a', '2022-04-13 05:36:12.773936', '2022-04-13 05:36:12.773936')
---
  def create
    comment = current_user.Comments.build(comment_params)
    comment.update!(debate_id: params[:id])
    comment.save!