app/controllers/debates_controller.rb

  def index
    @debates = Debate.all
---
SELECT `debates`.* FROM `debates`

  def destroy
    debate = Debate.find(params[:id])
    debate.destroy
---
DELETE FROM `debates` WHERE `debates`.`id` = 7

  def update
    debate = Debate.find(params[:id])
    debate.update!(debate_params)
---
UPDATE `debates` SET `debates`.`agenda` = 'aaabbb', `debates`.`updated_at` = '2022-03-23 04:48:08.395687' WHERE `debates`.`id` = 8