app/controllers/debates_controller.rb

  def show
    @debate = Debate.find(params[:id])
    # 議論作成者以外の参加者が議論に参加したらjoined_user_idに代入
    if @debate.joined_user_id.nil? and @debate.created_user_id != current_user.id
      @debate.update!(joined_user_id: current_user.id, wanted: false, started_at: Time.now)
    end
    #投票
    @vote = Vote.find_by(debate_id: @debate.id, voted_user_id: current_user.id) #観戦者が投票したときのみ存在する
    @votes = Vote.where(debate_id: @debate.id)
    #converstions
    @conversations = @debate.Conversations

    #コメント関連
    #comment
    @comment = current_user.Comments.build
    @comments = @debate.Comments

    #円グラフ用データ (参加者が揃っているときのみ定義する)
    if !(@debate.joined_user_id.nil?)
      @data = {@debate.created_user.name => @votes.where(debating_user_id: @debate.created_user.id).count, @debate.joined_user.name => @votes.where(debating_user_id: @debate.joined_user.id).count}
---
SELECT `debates`.* FROM `debates` WHERE `debates`.`id` = 22 LIMIT 1
INSERT INTO `debates` (`created_user_id`, `joined_user_id`, `agenda`, `created_at`, `updated_at`) VALUES (4, 1, 'test', '2022-03-22 12:00:30.813806', '2022-03-22 12:00:30.813806')
UPDATE `debates` SET `debates`.`joined_user_id` = 1, `debates`.`wanted` = FALSE, `debates`.`started_at` = '2022-03-24 10:30:16', `debates`.`updated_at` = '2022-03-24 10:30:16.328912' WHERE `debates`.`id` = 15
SELECT `votes`.* FROM `votes` WHERE `votes`.`debate_id` = 22 AND `votes`.`voted_user_id` = 1 LIMIT 1
INSERT INTO `conversations` (`user_id`, `debate_id`, `content`, `created_at`, `updated_at`) VALUES (3, 18, 'test4', '2022-04-06 11:03:00.102009', '2022-04-06 11:03:00.102009')
SELECT COUNT(*) FROM `votes` WHERE `votes`.`debate_id` = 22 AND `votes`.`debating_user_id` = 1
INSERT INTO `debates` (`created_user_id`, `agenda`, `wanted`, `created_at`, `updated_at`, `status`) VALUES (1, 'test_1', TRUE, '2022-04-03 10:42:51.170674', '2022-04-03 10:42:51.170674', 'before_vote')

  def create
    debate = current_user.create_debates.build(debate_params)
---
INSERT INTO `debates` (`created_user_id`, `agenda`, `wanted`, `created_at`, `updated_at`, `status`) VALUES (1, 'test', TRUE, '2022-04-20 10:12:14.324131', '2022-04-20 10:12:14.324131', 'before_vote')

  def destroy
    debate = Debate.find(params[:id])
    debate.destroy
---
SELECT `debates`.* FROM `debates` WHERE `debates`.`id` = NULL LIMIT 1
DELETE FROM `debates` WHERE `debates`.`id` = 17

  def edit
    @debate = Debate.find(params[:id])
---
SELECT `debates`.* FROM `debates` WHERE `debates`.`id` = 8 LIMIT 1

  def update
    debate = Debate.find(params[:id])
    debate.update!(debate_params)
---
SELECT `debates`.* FROM `debates` WHERE `debates`.`id` = 8 LIMIT 1
UPDATE `debates` SET `debates`.`finished_at` = '2022-03-28 02:35:30', `debates`.`updated_at` = '2022-03-28 02:35:30.692301' WHERE `debates`.`id` = 14

  def surrender
    debate = Debate.find(params[:id])
    #降参したユーザーが議論を作成したユーザーの場合
    if current_user.id == debate.created_user_id
      winorlose = debate.build_WinOrLose(loser_id: debate.created_user_id, winner_id: debate.joined_user_id)
      winorlose.save!
      debate.update!(finished_at: Time.now)
      redirect_back fallback_location: root_path
    end
    #降参したユーザーが議論に参加したユーザーの場合
    if current_user.id == debate.joined_user_id
      winorlose = debate.build_WinOrLose(loser_id: debate.joined_user_id, winner_id: debate.created_user_id)
      winorlose.save!
      debate.update!(finished_at: Time.now)
---
SELECT `debates`.* FROM `debates` WHERE `debates`.`id` = 13 LIMIT 1
INSERT INTO `win_or_loses` (`debate_id`, `winner_id`, `loser_id`, `created_at`, `updated_at`) VALUES (14, 1, 3, '2022-03-28 02:35:30.634766', '2022-03-28 02:35:30.634766')
UPDATE `debates` SET `debates`.`finished_at` = '2022-03-26 03:00:22', `debates`.`updated_at` = '2022-03-26 03:00:22.719354' WHERE `debates`.`id` = 16
UPDATE `debates` SET `debates`.`updated_at` = '2022-04-18 10:16:59.405522', `debates`.`status` = 'voting' WHERE `debates`.`id` = 19

  def vote_start
    @debate = Debate.find(params[:id])
    @debate.update!(status: "voting") #投票開始状態
    #制限時間（ミリ秒で渡されている）
    limit = params[:limit].to_f
    #投票開始時刻（jsに渡すために時間を変換している）
    vote_start_at = @debate.updated_at.to_f * 1000
---
SELECT `debates`.* FROM `debates` WHERE `debates`.`id` = 19 LIMIT 1
UPDATE `debates` SET `debates`.`updated_at` = '2022-04-19 02:43:36.605220', `debates`.`status` = 'voting' WHERE `debates`.`id` = 19
UPDATE `debates` SET `debates`.`finished_at` = '2022-04-20 02:30:48', `debates`.`updated_at` = '2022-04-20 02:30:48.149731', `debates`.`status` = 'after_vote' WHERE `debates`.`id` = 19
UPDATE `votes` SET `votes`.`voted_user_id` = 4, `votes`.`debating_user_id` = 1, `votes`.`updated_at` = '2022-04-14 04:01:49.142502' WHERE `votes`.`id` = 9

  def vote_finish
    debate = Debate.find(params[:id])
    debate.update!(status: "after_vote", finished_at: Time.now) #投票終了状態

    created_user_votes = Vote.where(debate_id: debate.id ,debating_user_id: debate.created_user_id).count || 0 #議論作成者への投票数
    joined_user_votes = Vote.where(debate_id: debate.id ,debating_user_id: debate.joined_user_id).count || 0 #議論参加者への投票数

    #投票数が多い方が勝者、少ない方が敗者
    if created_user_votes > joined_user_votes
      winorlose = debate.build_WinOrLose(loser_id: debate.joined_user_id, winner_id: debate.created_user_id)
---
SELECT `debates`.* FROM `debates` WHERE `debates`.`id` = 18 LIMIT 1
UPDATE `debates` SET `debates`.`finished_at` = '2022-04-22 01:32:08', `debates`.`updated_at` = '2022-04-22 01:32:08.058983', `debates`.`status` = 'after_vote' WHERE `debates`.`id` = 18
SELECT COUNT(*) FROM `votes` WHERE `votes`.`debate_id` = 18 AND `votes`.`debating_user_id` = 3
INSERT INTO `win_or_loses` (`debate_id`, `winner_id`, `loser_id`, `created_at`, `updated_at`) VALUES (19, 1, 3, '2022-04-20 02:33:56.404105', '2022-04-20 02:33:56.404105')

  def vote_created_user
    debate = Debate.find(params[:id])
    vote = current_user.voting.build(debating_user_id: debate.created_user_id ,debate_id: params[:id])
---
SELECT `debates`.* FROM `debates` WHERE `debates`.`id` = 13 LIMIT 1
INSERT INTO `votes` (`debate_id`, `voted_user_id`, `debating_user_id`, `status`, `created_at`, `updated_at`) VALUES (13, 4, 3, 'before_vote', '2022-03-28 10:33:22.459112', '2022-03-28 10:33:22.459112')