app/controllers/debates_controller.rb

  def destroy
    debate = Debate.find(params[:id])
---
SELECT `debates`.* FROM `debates` WHERE `debates`.`id` = 8 LIMIT 1

  def surrender
    debate = Debate.find(params[:id])
    #降参したユーザーが議論を作成したユーザーの場合
    if current_user.id == debate.created_user_id
      winorlose = debate.build_WinOrLose(loser_id: debate.created_user_id, winner_id: debate.joined_user_id)
---
INSERT INTO `win_or_loses` (`debate_id`, `winner_id`, `loser_id`, `created_at`, `updated_at`) VALUES (16, 1, 3, '2022-03-26 03:00:22.687541', '2022-03-26 03:00:22.687541')

  def vote_start
    debate = Debate.find(params[:id])
    debate.update!(status: "voting") #投票開始状態
    vote = debate.build_Vote
    vote.save!
---
INSERT INTO `votes` (`debate_id`, `voted_user_id`, `debating_user_id`, `status`, `created_at`, `updated_at`) VALUES (13, 4, 3, 'before_vote', '2022-03-28 10:33:22.459112', '2022-03-28 10:33:22.459112')

  def vote_created_user
    debate = Debate.find(params[:id])
    @vote = Vote.find_by(debate_id: params[:id])
    @vote.update!(voted_user_id: current_user.id, debating_user_id: debate.created_user_id)
---
SELECT `votes`.* FROM `votes` WHERE `votes`.`debate_id` = 19 LIMIT 1
UPDATE `votes` SET `votes`.`voted_user_id` = 4, `votes`.`debating_user_id` = 1, `votes`.`status` = 'voted', `votes`.`updated_at` = '2022-03-29 03:27:22.379325' WHERE `votes`.`id` = 7