app/controllers/likes_controller.rb

INSERT INTO `likes` (`debate_id`, `user_id`, `created_at`, `updated_at`) VALUES (18, 1, '2022-04-11 12:04:12.767119', '2022-04-11 12:04:12.767119')
---
  def create
    @like = Like.new(user_id: current_user.id, debate_id: params[:debate_id])
    @like.save!

SELECT `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`debate_id` = 18 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 5
---
  def destroy
    @like = Like.find_by(user_id: current_user.id, debate_id: params[:debate_id])
    @like.destroy

SELECT `debates`.* FROM `debates` WHERE `debates`.`id` = 18 LIMIT 1
---
  def debate_params
    @debate = Debate.find(params[:debate_id])