app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def following
    @title = "Following"
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

  def followers
    @title = "Followers"
    @user  = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

  def wins
    @title = "勝った議論一覧"
    @user  = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

  def loses
    @title = "負けた議論一覧"
    @user  = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1