app/models/user.rb

SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`debate_id` = 23 LIMIT 1
---
  def liked?(debate)
    self.likes.exists?(debate_id: debate.id)